## 입출력

In [29]:
%pwd

'C:\\cakd7\\복습'

In [30]:
import os
os.chdir('C:\cakd7\m2_분석라이브러리활용\pandas\dataset')

In [7]:
import numpy as np
import pandas as pd

In [14]:
#데이터프레임 생성
df=pd.DataFrame(np.arange(10).reshape(2,5),columns=list('abcde'))
df

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

#### csv 파일 입출력

In [15]:
#csv파일로 저장
df.to_csv('test.csv')

In [17]:
#파일 다시 불러오기
df_c=pd.read_csv('test.csv',index_col=0)
df_c

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

#### json 파일 입출력

In [18]:
#json 파일로 저장
df.to_json('test.json')

In [24]:
#파일 다시 불러오기
df_j=pd.read_json('test.json')
df_j

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

#### 바이너리 파일 입출력
- 텍스트파일보다 용량차지가 덜하다

In [22]:
df.to_pickle('test.pkl')

In [23]:
df_p=pd.read_pickle('test.pkl')
df_p

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

#### 엑셀 파일 입출력

In [31]:
import openpyxl

In [64]:
df_x=pd.read_excel('auto-mpg.xlsx')
df_x

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

-  mpg: 연비
-   cylinders: 실린더 개수
-   displacement: 배기량
-   horsepower: 마력
-   weight: 무게
-   acceleration: 엔진이 초당 얻을 수 있는 가속력
-   model year: 출시 년도
-   origin: 제조 장소(1: 미국, 2: 유럽, 3: 아시아)
-   car name: 자동차 이름

In [37]:
df_x.info()

#horsepower 변수가 문자형
# model year 변수가 숫자형

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [41]:
df_x.horsepower.values

array([130, 165, 150, 150, 140, 198, 220, 215, 225, 190, 170, 160, 150,
       225, 95, 95, 97, 85, 88, 46, 87, 90, 95, 113, 90, 215, 200, 210,
       193, 88, 90, 95, '?', 100, 105, 100, 88, 100, 165, 175, 153, 150,
       180, 170, 175, 110, 72, 100, 88, 86, 90, 70, 76, 65, 69, 60, 70,
       95, 80, 54, 90, 86, 165, 175, 150, 153, 150, 208, 155, 160, 190,
       97, 150, 130, 140, 150, 112, 76, 87, 69, 86, 92, 97, 80, 88, 175,
       150, 145, 137, 150, 198, 150, 158, 150, 215, 225, 175, 105, 100,
       100, 88, 95, 46, 150, 167, 170, 180, 100, 88, 72, 94, 90, 85, 107,
       90, 145, 230, 49, 75, 91, 112, 150, 110, 122, 180, 95, '?', 100,
       100, 67, 80, 65, 75, 100, 110, 105, 140, 150, 150, 140, 150, 83,
       67, 78, 52, 61, 75, 75, 75, 97, 93, 67, 95, 105, 72, 72, 170, 145,
       150, 148, 110, 105, 110, 95, 110, 110, 129, 75, 83, 100, 78, 96,
       71, 97, 97, 70, 90, 95, 88, 98, 115, 53, 86, 81, 92, 79, 83, 140,
       150, 120, 152, 100, 105, 81, 90, 52, 60, 70, 53, 100, 78, 110, 95,
       71, 70, 75, 72, 102, 150, 88, 108, 120, 180, 145, 130, 150, 68, 80,
       58, 96, 70, 145, 110, 145, 130, 110, 105, 100, 98, 180, 170, 190,
       149, 78, 88, 75, 89, 63, 83, 67, 78, 97, 110, 110, 48, 66, 52, 70,
       60, 110, 140, 139, 105, 95, 85, 88, 100, 90, 105, 85, 110, 120,
       145, 165, 139, 140, 68, 95, 97, 75, 95, 105, 85, 97, 103, 125, 115,
       133, 71, 68, 115, 85, 88, 90, 110, 130, 129, 138, 135, 155, 142,
       125, 150, 71, 65, 80, 80, 77, 125, 71, 90, 70, 70, 65, 69, 90, 115,
       115, 90, 76, 60, 70, 65, 90, 88, 90, 90, 78, 90, 75, 92, 75, 65,
       105, 65, 48, 48, 67, 67, 67, '?', 67, 62, 132, 100, 88, '?', 72,
       84, 84, 92, 110, 84, 58, 64, 60, 67, 65, 62, 68, 63, 65, 65, 74,
       '?', 75, 75, 100, 74, 80, 76, 116, 120, 110, 105, 88, 85, 88, 88,
       88, 85, 84, 90, 92, '?', 74, 68, 68, 63, 70, 88, 75, 70, 67, 67,
       67, 110, 85, 92, 112, 96, 84, 90, 86, 52, 84, 79, 82], dtype=object)

In [45]:
#horsepower 문자값을 결측값으로 바꿔줌
df_x.loc[df_x['horsepower']=='?','horsepower']=np.nan

In [47]:
df_x.info()
#여전히 object 데이터타입을 취함

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [55]:
df_x['horsepower']=df_x['horsepower'].astype(float)

In [56]:
df_x.info()
#float타입으로 변경됨

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(4), int64(4), object(1)
memory usage: 28.1+ KB

In [65]:
#model year을 19xx연도로 바꾸기
df_x['model year']+=1900
df_x['model year']

0      1970
1      1970
2      1970
3      1970
4      1970
       ...
393    1982
394    1982
395    1982
396    1982
397    1982
Name: model year, Length: 398, dtype: int64

In [72]:
#model year을 datetime 타입으로 바꾸기

df_x['model year']=pd.to_datetime(df_x['model year'],format='%Y').dt.year
df_x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [6]:
os.chdir('C:/cakd7/복습')